{
  "data": [
    {
      "id": 1,
      "blogCategory": "Updates",
      "blogTitle": "Regulatory Sandbox",
      "slug": "regulatory-sandbox",
      "postedOn": "Nov 2021",
      "author": "chainScript",
      "blogImage": "regulatory-sandbox.jpg",
      "blogText": "“India is amongst the fastest growing fintech markets in the world. Of the 2,100+ fintechs existing in India today, over 67% have been set up in the last 5 years. The Indian fintech market is currently valued at $61 Bn and is expected to grow to $84 Bn by 2023.” Reserve Bank of India(RBI) to spur innovation has set up Regulatory Sandbox from retail payment, cross-border payment to MSME lending. The regulatory sandbox allows the regulator, innovators, financial service providers and customers to conduct field tests to collect evidence on the benefits and risks of new financial innovations, while carefully monitoring and containing their risks.It can provide a structured avenue for the regulator to engage with the ecosystem and to develop innovation-enabling or innovation-responsive regulations that facilitate the delivery of relevant, low-cost financial products.",
      "blogText2": "The objective of the regulatory sandbox is to foster responsible innovation in financial services, promote efficiency and bring benefits to consumers. Innovators and fintech startups can improve their understanding of regulations that govern fintech offerings and shape their products accordingly.The Reserve Bank’s Regulatory Sandbox (RS) has so far introduced three cohorts. Six entities have successfully exited the First Cohort on ‘Retail Payments’ while under the Second Cohort on ‘Cross Border Payments’ eight entities are undertaking Tests.",
      "blogText3": "RBI in line with their vision to keep the fintech ecosystem engaged has decided to select ‘Prevention and Mitigation of Financial Frauds’ as the theme for the Fourth Cohort. The focus would be on using technology to reduce the lag between the occurrence and detection of frauds, strengthening the fraud governance structure and minimising response time to frauds.In addition, based on the experience gained and the feedback received from stakeholders, RBI’s ‘Enabling Framework for Regulatory Sandbox’ has been updated to include ‘On Tap’ application facility for themes of closed cohorts. Accordingly, the theme ‘Retail Payments’ is now open for application. This ‘On Tap’ facility is expected to help in continuous innovation and engagement with innovators and proactively respond to the dynamics of the rapidly evolving FinTech scenario.",
      "blogText4": "In addition, based on the experience gained and the feedback received from stakeholders, RBI’s ‘Enabling Framework for Regulatory Sandbox’ has been updated to include ‘On Tap’ application facility for themes of closed cohorts. Accordingly, the theme ‘Retail Payments’ is now open for application. This ‘On Tap’ facility is expected to help in continuous innovation and engagement with innovators and proactively respond to the dynamics of the rapidly evolving FinTech scenario.The opportunity here is timely, especially for BSV blockchain, to engage the government, showcase the real innovation behind BSV's scalable, sustainable, secure technology and how it can empower a billion-plus people with micro-transactions, secure payments, data sovereignty.",
      "blogText5": "The Indian financial industry has seen cumulative investments into domestic fintechs of more than $10 Bn since 2016. The Indian fintech industry ecosystem offers a wide range of subsegments, including Payments, Lending, Wealth Technology (WealthTech), Personal Finance Management, Insurance Technology (InsurTech), Regulation Technology (RegTech), etc.As a BSV entrepreneur and proud Indian, I invite BSV ventures, tech houses and associations to explore with us or individually the growth potential here in INDIA. Applying for the regulatory sandbox under the relevant cohort would be the goal.",
      "postTitle": "It is about time- we at BSV Blockchain show a billion-plus people how we can transform the payments landscape to bring efficient, transparent systems. "
    },
    {
      "id": 2,
      "blogCategory": "Updates",
      "blogTitle": "Bitcoin Association Ambassadors",
      "slug": "bitcoin-association-ambassadors",
      "postedOn": "Dec 2021",
      "author": "chainScript",
      "blogImage": "indiaambassdors.jpg",
      "blogText": "ZUG, Switzerland, Dec. 8, 2021 /PRNewswire/ -- Bitcoin Association, the Switzerland-based global industry organisation that works to advance business with the Bitcoin SV (BSV) blockchain, today announces that it has appointed two new Bitcoin Association Ambassadors as part of its global ambassador programme, with Kumaraguru Ramanujam and Rohan Sharan both appointed as Bitcoin Association Ambassadors for India.",
      "blogText2": "Bitcoin Association Ambassadors are experienced professionals from the Bitcoin SV ecosystem who work to raise awareness and improve understanding of the Bitcoin SV blockchain and BSV digital currency, as well as the power of the original Bitcoin protocol as a massively scaled distributed data network all around the world.  With today's additions, there are now 27 Bitcoin Association Ambassadors representing 26 different countries and territories.",
      "blogText3": "Kumaraguru Ramanujam is the Founder and Managing Director of a pair of Bitcoin SV product and applications development houses: BlockReview Pte LTD in Singapore and ChainScript Labs Pvt Ltd in India. A seasoned entrepreneur and experienced professional, Ramanujam was previously the Founding Director of Peer Review, a UAE-based business that worked with government entities and organisations in the gulf on disruptive technologies like big data and deep learning.",
      "blogText4": "Speaking on today's announcement, Bitcoin Association Founding President Jimmy Nguyen, commented:Bitcoin SV continues to grow all over the world, providing vital blockchain infrastructure to governments, enterprises and end-users. As the BSV growth story builds, so too does the need for us to build out our team of Bitcoin Association Ambassadors to support the emerging communities.Both Rohan and Kumaraguru have shown a true passion for Bitcoin and have been generous with their time to grow awareness and understanding in their native India. They have been excellent advocates for the technology and representatives in the broader community - experience that will serve them well in their new roles as Bitcoin Association Ambassadors.",
      "blogText5": "Bitcoin SV has the potential to truly empower millions of people in India. Cheap and instant microtransactions from anywhere in the world can revolutionise the way that people work while creating all-new incentive models that empower Indian talent. In this new role, I will work to build awareness of the opportunities enabled by the BSV block and help to empower developers, entrepreneurs and young talent to utilise the technology. Bitcoin Association is the Switzerland-based global industry organization that works to advance business on the Bitcoin SV blockchain. It brings together essential components of the Bitcoin SV ecosystem – enterprises, start-up ventures, developers, merchants, exchanges, service providers, blockchain transaction processors (miners), and others – working alongside them, as well as in a representative capacity, to drive further use of the Bitcoin SV blockchain and uptake of the BSV digital currency. BSV is the only Bitcoin implementation that fulfils Dr Craig S. Wright's vision for an unbounded global blockchain infrastructure The Association works to build a regulation-friendly ecosystem that fosters lawful conduct while facilitating innovation using all aspects of Bitcoin technology. More than a digital currency and blockchain, Bitcoin is also a network protocol; just like Internet protocol, it is the foundational rule set for an entire data network. The Association supports use of the original Bitcoin protocol to operate the world's single blockchain on Bitcoin SV.",
      "postTitle": "Bitcoin Association appoints two new global ambassadors for India to advance Bitcoin SV (BSV) "
    },
    {
      "id": 3,
      "blogCategory": "Events",
      "blogTitle": "Better payments with BSV",
      "slug": "bsv-convention-bringing-better-payments-with-bsv",
      "postedOn": "May 2022",
      "author": "ChainScript",
      "blogImage": "bsv-convention.jpg",
      "blogText": "Satoshi Nakamoto described Bitcoin on the white paper as “a purely peer-to-peer version of electronic cash.” Satoshi’s vision was cast aside for the longest time, and Bitcoin was touted to be digital gold, a hedge against inflation, and anything else but electronic cash. This vision has been restored through Bitcoin SV, and on Day 2 of the BSV Global Blockchain Convention, four leaders who are making this dream a reality took to the stage to talk about availing better payments with BSV.",
      "blogText2": "The panel titled “Better Payments with BSV” was moderated by CoinGeek’s Patrick Thompson, Centbee’s Lorien Gamaroff, MoneySwipe’s Kumaraguru Ramanujam, HandCash Co-founder Rafa Jimenez, and Centi’s Bernhard Müller being the panelists.",
      "blogText3": "The question many outside Bitcoin ask is why turn to BSV while they already have a Visa card, or they can make payments through Apple Pay, Venmo, and the rest.",
      "blogText4": "The very low costs of BSV payments and the inherent traceability on the BSV blockchain are two of the biggest reasons to hop on Bitcoin, Lorien noted. His company, Centbee, has been among the leading BSV payments platforms, allowing users, most of them young people, to pay at major outlets without converting their Bitcoin to fiat.",
      "blogText5": "MoneySwipe’s target is a bit different. Ramanujam tells the audience that he wants to change the remittance landscape, especially in his homeland of India, the world’s largest remittance destination. Last year, the country, which is home to 17% of the world’s population, received $87 billion in remittances, but the fees to the consumers are still way too high.",
      "blogText6": "With all the developments in Bitcoin payments, consumers are spoilt for choice and sometimes can be overwhelmed. Centi’s Müller believes it may be about time for BSV payments to be standardized. This would allow the different platforms to inter-transact and offer customers more choice and diversity.",
      "blogText7": " Centi users who want to send remittances to India could do so directly through MoneySwipe and pay for their groceries through Centbee while enjoying Haste Arcade through HandCash.There’s a caveat, however.",
      "blogText8": "“If you’re using such standards, you’re also opening yourself up to competition. You need to stay best in class… [Your users] know they can go somewhere else. But in standardizing, we allow the whole ecosystem to connect together and it will be much easier for new companies to integrate,” he said.",
      "blogText9": "With the BSV Global Blockchain Convention being held in the Middle East for the first time, the panelists talked about why the region should pay attention to Bitcoin SV payments.",
      "blogText10": "For Lorien, the pro-regulatory nature of BSV makes it the best option for a region that’s subject to both state and Shariah laws. Middle Easterners should get rid of the preexisting narrative about what Bitcoin is and embrace BSV for payments, the Centbee CEO told the audience.",
      "blogText11": "The GCC (Gulf Cooperation Council) region is one of the biggest outward remitters in the world, Ramanujam added, and thus could greatly benefit from the low-cost remittances on BSV. Indeed, the region’s workforce has one of the highest numbers of foreigners. The UAE is right up on the list, and in 2020, it was the world’s biggest outward remitter after the U.S. with $43 billion. ",
      "blogText12": "“BSV can be used in frontend and backend systems. By enabling BSV as a settlement layer or as a bridge asset, we can fill that gap in international cross-border payments and domestic payments,” he noted.",
      "blogText13": "On what their companies are looking forward to in the future, Jimenez revealed that HandCash is set to add payment links that allow up to 1000 recipients/senders at once, with notifications for every single payment.",
      "blogText14": "Centi is set to integrate with a Swiss payment platform and will be included in the checkout process, bringing the power of low-fee BSV micropayments to the masses. It’s also targeting the events industry and is already working with a few partners, promising “the first event powered by Centi” very soon.",
      "blogText15": "MoneySwipe, the newest company among the four, is working on being regulatory compliant and is looking forward to launching a U.K.-India payments corridor remittance product before the end of the year.",
      "postTitle": "BSV Convention:Better payments with BSV ",
      "videoLink": "https://www.youtube.com/watch?v=mizzYMyRDkE&t=3s",
      "videoLink2": "https://youtu.be/ggbZ8YedpBE"
    },
    {
      "id": 4,
      "blogCategory": "Updates",
      "blogTitle": "Our Inspiration",
      "slug": "dilip-ratha-our-inspiration",
      "postedOn": "Jun 2022",
      "author": "ChainScript",
      "blogImage": "dilip-ratha.jpg",
      "blogText": "Below is an inspirational video from a legend in the remittance industry Dilip Ratha. This video is from 2014 and has approximately 1.5 million views. Much has changed since this video but much remains the same.Talks like this still motivate startups like us to work for the good, aim for the lowest fee and build for the future. ",
      "blogText2": "We understand revolutionary technology like #bsv #blockchaintechnology are enablers but we the people will have to make it happen.",
      "blogText3": "In 2013, international migrants sent $413 billion home to families and friends — three times more than the total of global foreign aid (about $135 billion).",
      "blogText4": "This money, known as remittances, makes a significant difference in the lives of those receiving it and plays a major role in the economies of many countries. Economist Dilip Ratha describes the promise of these “dollars wrapped with love” and analyzes how they are stifled by practical and regulatory obstacles.",
      "blogText5": "Economist Dilip Ratha was the first to analyze the global significance of remittances -- money sent from foreign workers to their families back home.",
      "postTitle": "Dilip Ratha:The hidden force in global economics:sending money home ",
      "videoLink": "https://youtu.be/Oj8eFu72_fc"
    },
    {
      "id": 5,
      "blogCategory": "Updates",
      "blogTitle": "Our Advisor",
      "slug": "antonino-sardego-our-adivisor",
      "postedOn": "Jun 2022",
      "author": "ChainScript",
      "blogImage": "antonino.jfif",
      "blogText": "With great pleasure, We introduce our mentor and first advisor to MoneySwipe. Antonino S., Managing Partner, Hummingbird Capital Partners Ltd. We look forward to his guidance and support in our journey towards value creation and building a safe and cost-effective cross-border remittance service.",
      "postTitle": "Antonini Sardego-Our Advisor "
    },
    {
      "id": 6,
      "blogCategory": "Updates",
      "blogTitle": "CTO, MoneySwipe",
      "slug": "ramesh-belavadi-cto-chainscript",
      "postedOn": "July 2022",
      "author": "chainScript",
      "blogImage": "ramesh.png",
      "blogText": "With great pleasure and delight, we introduce our Chief Technology Officer, Ramesh Belavadi. He is the chief architect of our Inter-CBDC protocol that looks to innovate how cross-border transactions are recorded and settled worldwide.",
      "blogText2": "Mr Ramesh is a blockchain developer, publisher and innovator who holds patents in blockchain technology in USA, India and elsewhere. Mr Ramesh is a veteran software developer with 20 plus years of software engineering experience in varied roles such as development, testing, performance enhancement, training and team innovation.",
      "blogText3": "Mr Ramesh has spent 15 years at IBM as a software engineer and a 5-year tenure in California with Infosoft and Metabyte. He is an Electrical Engineer from M.S.R.I.T Bangalore and holds a Master of Technology from the Indian Institute of Technology, Kharagpur.",
      "blogText4": "Mr Ramesh is passionate about developing new ideas and training staff on patent development, web, mobile, backend and server frameworks and tools.Please join us in welcoming him to the family.",
      "postTitle": "Ramesh Belavadi, CTO, MoneySwipe"
    },
    {
      "id": 7,
      "blogCategory": "Interviews",
      "blogTitle": "Cross border payment with Bitcoin SV ",
      "slug": "kumaraguru-ramanujam-using-bitcoin-sv-to-send-money-across-borders",
      "postedOn": "August 2022",
      "author": "coingeek",
      "blogImage": "kumaraguru-ramanujam.jpg",
      "blogText": "When Bitcoin was first invented, many hailed it as the solution to inefficient cross-border remittances. But because of the high fees associated with transactions on the BTC Core network, it has never been able to live up to its full potential.",
      "blogText2": "That’s why Kumaraguru Ramanujam has chosen to build on the Bitcoin SV blockchain instead. His application, MoneySwipe, aims to bring down fees for sending money abroad from the current global average of 7% to just 1.5%.",
      "blogText3": "He explains to Charles Miller on this week’s episode of CoinGeek Conversations that the company is aiming to tackle the U.K.–India remittance corridor first. This makes a lot of sense as India tops the list of countries receiving personal remittances. According to a 2022 World Bank Report, a whopping $83 billion is sent back to the country each year in payments.",
      "blogText4": "Ramanujam’s plan is to work with regulators in India to create a cross-border payment solution without high costs. He explains that the Reserve Bank of India (RBI) has set up a regulatory sandbox with the intention of finding companies using blockchain to bring efficiency to the billion-dollar remittance industry.",
      "blogText5": "The sandbox originally opened in 2018, with a company using Hyperledger Fabric selected, but it has now reopened, and Ramanujam is keen to show the RBI the power of Bitcoin SV.",
      "blogText6": "“We first show the regulator that BSV’s better than Hyperledger then we show them, okay, yeah, transfer of value can also happen,” he said. ",
      "blogText7": "The introduction of an efficient remittance system like this would be a gamechanger for the Indian economy. If costs could be brought down to 1.5%, this would mean over $4 billion could be saved and go straight to the recipient, instead of being lost in fees. This would also benefit the government as it would receive more foreign exchange reserves. ",
      "blogText8": "“It’s a win-win and it’s a stated aim of the United Nations’ sustainability goals to bring remittances down from 7% to 3%,” Ramanujam points out. ",
      "blogText9": "While the application is powered by the BSV blockchain, stablecoins have been enabled so they can be used as a bridge asset, to ensure liquidity and comply with regulation. ",
      "blogText10": "The final application, which will be launched by the end of the year, will be informed by how MoneySwipe engages with regulators. The hope is that by working closely with them, the final product will be innovative, relevant, and risk-free. ",
      "blogText11": "The focus for now is India and the corridor with the U.K., but once this has been developed, he intends to turn his attention to other regulators to create remittance solutions that work with governments across the globe. ",
      "blogText12": "Ramanujam believes that being able to show experience working successfully with one regulator will make it easier with others.  ",
      "blogText13": "“We want to work with the regulator who’s open with their policies right now, rather than us telling them this is how things have to be done—so we are looking at countries that are open right now with sandboxes,” he said.",
      "postTitle": "Kumaraguru Ramanujam:Cross border payment with Bitcoin SV ",
      "subtitleLast": "Hear the whole of Kumaraguru Ramanujam’s interview in this week’s CoinGeek",
      "videoLink": "https://www.youtube.com/watch?v=mizzYMyRDkE&t=3s"
    },
    {
      "id": 8,
      "blogCategory": "Interviews",
      "blogTitle": "MoneySwipe aims to bring down remittance fees to 1.5%",
      "slug": "moneyswipe-bring-down-remittance-fees-1.5",
      "postedOn": "August 2022",
      "author": "chainScript",
      "blogImage": "kgr.png",
      "blogText": "Kumaraguru Ramanujam explains to Charles Miller  about the company's aim to tackle the U.K.–India remittance corridor first. This makes a lot of sense as India tops the list of countries receiving personal remittances. According to a 2022 World Bank Report, a whopping $83 billion is sent back to the country each year in payments.",
      "postTitle": "Kumaraguru Ramanujam:MoneySwipe aims to bring down remittance fees to 1.5%",
      "videoLink": "https://youtu.be/zbPC8sOPsPw"
    },
    {
      "id": 9,
      "blogCategory": "Events",
      "blogTitle": "Venture capital for metanet economy | EUBS 2022",
      "slug": "venture-capital-metanet-economy-kumaraguru-antonino-osmincallis-anupai",
      "postedOn": "August 2022",
      "author": "chainScript",
      "blogImage": "eubs-venture-capital.png",
      "blogText": "What opportunities does the Metanet economy hold for Venture Capital?",
      "blogText1": "Kumaraguru Ramanujam (Founder & CEO of MoneySwipe) is joined by",
      "blogText3": "Osmin Callis (Managing Director at Block Venture Studio)",
      "blogText4": "Anup Pai (Founder & CEO of eSamudaay)",
      "blogText5": "Saloni Jain (Founding Partner at Sunicon Ventures) and Antonino Sardegno (Managing Partner at Hummingbird Capital Partners Ltd) to discuss venture capital for the metanet economy at EUBS 2022",
      "postTitle": "Kumaraguru Ramanujam:Venture capial for metanet economy",
      "videoLink": "https://youtu.be/5aQ_XW60iWg"
    },
    {
      "id": 10,
      "blogCategory": "Interviews",
      "blogTitle": "Our Advisor",
      "slug": "mohammed-ibrahim-jega-our-advisor",
      "postedOn": "Sep 2022",
      "author": "ChainScript",
      "blogImage": "mohammed-ibrahim-jega.jfif",
      "blogText": "With great pleasure, we introduce our new mentor and advisor from the land of opportunities: Nigeria MOHAMMED IBRAHIM JEGA, Co-founder, Domineum Blockchain Solutions Limited. ",
      "blogText2": "Mohammed Ibrahim Jega is an accomplished highly-organized Project Manager and Business Developer with 18+ years of experience. He is also a Serial Tech Entrepreneur, Startup Advisor/Mentor, Fintech Expert, Blockchain Advocate, International Partner World Business Angel Investment Forum (WBAF), an Official member at Forbes Business Council and Director at Sillicon Valley based Founder Institute.",
      "blogText3": "Mohammed Co-founded Domineum Blockchain Solutions, a Distributed Ledger Technology Company providing Blockchain-as-a-service solution. He is a Director at Vogue Pay, an online payment processing company and also a Director at Vpd.money, a challenger bank. He is the Chief Marketing Officer at mAcademy, an e-learning platform with the vision to get quality and affordable learning at fingertips of every Nigerian. Founder of Startup Arewa, a platform designed to build a sustainable northern tech ecosystem and unlock the potential of the region.",
      "blogText4": "He is one of the 30 Nominee of Abuja based African Digital Voices inducted into AFRICAN DIGITAL VOICES NETWORK. He sits on the board of several tech tech companies such as Chairman Board AgriTECH Hub, Impact Hub, FSI, Hartfield Group,Young Innovators Nigeria, Nigeria Association of Computing Students (NACOS), Kickcity, Ambassador Cyber Security Challenge Nigeria (CYSEC-NG), and Regional Ambassador Codefest International.",
      "blogText5": "He has received several awards both locally and internationally such as the winner of the Africa’s Entrepreneur of the Year 2020 by the Tech Times African Influencer Award; Future Awards Africa nominee for Service to Young People; and recognized as the most influential young Nigerian in 2017 by Avance Media and awarded Royal African Young Leadership Forum Award 2021 by Oba Adeyeye Enitan Ogunwusi the Ooni of Ife.We look forward to Mohammed's council in building a cross-border payment solution that address problems in the legacy systems and brings emerging markets like India and Nigeria in the forefront of Fintech innovation.",
      "postTitle": "Mohammed Ibrahim Jega-Our Advisor"
    }
  ]
}